app/controllers/sweets_controller.rb

SELECT "sweets".* FROM "sweets"
---
  def index
    @sweets = Sweet.all

INSERT INTO "sweets" ("name", "email", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "kiruba"], ["email", "kiruba@gmail.com"], ["description", "sweetest sisy in my life"], ["created_at", "2015-10-09 06:29:07.502225"], ["updated_at", "2015-10-09 06:29:07.502225"]]
---
  def create
    @sweet = Sweet.new(sweet_params)

    respond_to do |format|
      if @sweet.save

SELECT  "sweets".* FROM "sweets" WHERE "sweets"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_sweet
      @sweet = Sweet.find(params[:id])